hca-api-stub/hasan-1-tcpdump.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope 
  xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" 
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
  xmlns:tns="http://va.gov/service/esr/voa/v1" 
  xmlns:ns1="http://va.gov/schema/esr/voa/v1">
  <soap:Body>
    <ns1:submitFormRequest 
      xmlns:ns1="http://va.gov/schema/esr/voa/v1" 
      xmlns="http://va.gov/schema/esr/voa/v1">
      <ns1:saveSubmitFormResult>
        <ns1:submitFormRequest>
          <ns1:form>
            <ns1:formIdentifier>
              <ns1:type>100</ns1:type>
              <ns1:value>1010EZ</ns1:value>
            </ns1:formIdentifier>
            <ns1:summary>
              <ns1:demographics>
                <ns1:appointmentRequestResponse>true</ns1:appointmentRequestResponse>
                <ns1:contactInfo>
                  <ns1:addresses>
                    <ns1:address>
                      <ns1:city>Jacksonville</ns1:city>
                      <ns1:country>USA</ns1:country>
                      <ns1:line1>232 FAKE Dr</ns1:line1>
                      <ns1:state>NC</ns1:state>
                      <ns1:zipCode>28540</ns1:zipCode>
                      <ns1:addressTypeCode>P</ns1:addressTypeCode>
                    </ns1:address>
                  </ns1:addresses>
                </ns1:contactInfo>
                <ns1:ethnicity>2186-5</ns1:ethnicity>
                <ns1:maritalStatus>M</ns1:maritalStatus>
                <ns1:preferredFacility>608</ns1:preferredFacility>
                <ns1:races>
                  <ns1:race>2106-3</ns1:race>
                </ns1:races>
                <ns1:acaIndicator>false</ns1:acaIndicator>
              </ns1:demographics>
              <ns1:enrollmentDeterminationInfo>
                <ns1:eligibleForMedicaid>false</ns1:eligibleForMedicaid>
                <ns1:noseThroatRadiumInfo>
                  <ns1:receivingTreatment>false</ns1:receivingTreatment>
                </ns1:noseThroatRadiumInfo>
                <ns1:serviceConnectionAward>
                  <ns1:serviceConnectedIndicator>false</ns1:serviceConnectedIndicator>
                </ns1:serviceConnectionAward>
                <ns1:specialFactors>
                  <ns1:agentOrangeInd>false</ns1:agentOrangeInd>
                  <ns1:envContaminantsInd>false</ns1:envContaminantsInd>
                  <ns1:campLejeuneInd>false</ns1:campLejeuneInd>
                  <ns1:radiationExposureInd>false</ns1:radiationExposureInd>
                </ns1:specialFactors>
              </ns1:enrollmentDeterminationInfo>
              <ns1:insuranceList>
                <ns1:insurance>
                  <ns1:companyName>Medicare</ns1:companyName>
                  <ns1:enrolledInPartA>false</ns1:enrolledInPartA>
                  <ns1:enrolledInPartB>false</ns1:enrolledInPartB>
                  <ns1:insuranceMappingTypeName>MDCR</ns1:insuranceMappingTypeName>
                </ns1:insurance>
              </ns1:insuranceList>
              <ns1:militaryServiceInfo>
                <ns1:disabilityRetirementIndicator>false</ns1:disabilityRetirementIndicator>
                <ns1:dischargeDueToDisability>false</ns1:dischargeDueToDisability>
                <ns1:militaryServiceSiteRecords>
                  <ns1:militaryServiceSiteRecord>
                    <ns1:militaryServiceEpisodes>
                      <ns1:militaryServiceEpisode>
                        <ns1:endDate>06/28/2015</ns1:endDate>
                        <ns1:serviceBranch>4</ns1:serviceBranch>
                        <ns1:startDate>08/08/2004</ns1:startDate>
                        <ns1:dischargeType>1</ns1:dischargeType>
                      </ns1:militaryServiceEpisode>
                    </ns1:militaryServiceEpisodes>
                    <ns1:site>565GC</ns1:site>
                  </ns1:militaryServiceSiteRecord>
                </ns1:militaryServiceSiteRecords>
              </ns1:militaryServiceInfo>
              <ns1:prisonerOfWarInfo>
                <ns1:powIndicator>false</ns1:powIndicator>
              </ns1:prisonerOfWarInfo>
              <ns1:purpleHeart>
                <ns1:indicator>false</ns1:indicator>
              </ns1:purpleHeart>
              <ns1:personInfo>
                <ns1:firstName>SAL</ns1:firstName>
                <ns1:middleName>F</ns1:middleName>
                <ns1:lastName>VOASAL</ns1:lastName>
                <ns1:ssnText>498745223</ns1:ssnText>
                <ns1:gender>M</ns1:gender>
                <ns1:dob>02/08/1981</ns1:dob>
                <ns1:mothersMaidenName>Young</ns1:mothersMaidenName>
                <ns1:placeOfBirthCity>Mt Vernon</ns1:placeOfBirthCity>
                <ns1:placeOfBirthState>MO</ns1:placeOfBirthState>
              </ns1:personInfo>
            </ns1:summary>
            <ns1:applications>
              <ns1:applicationInfo>
                <ns1:appDate>2015-12-21</ns1:appDate>
                <ns1:appMethod>1</ns1:appMethod>
              </ns1:applicationInfo>
            </ns1:applications>
          </ns1:form>
          <ns1:identity>
            <ns1:authenticationLevel>
              <ns1:typ
              </ns1:type>
              <ns1:value>anonymous</ns1:value>
            </ns1:authenticationLevel>
          </ns1:identity>
        </ns1:submitFormRequest>
      </ns1:saveSubmitFormResult>
    </ns1:submitFormRequest>
  </soap:Body>
</soap:Envelope>